export type IMuscle = {
  id: number;
  name: string;
  photo?: string;
};

export type IMuscleGroup = {
  id: number;
  name: string;
  photo?: string;
  muscle: IMuscle[];
};

export type IMuscleGroupCreate = Omit<IMuscleGroup, "id">;

const muscleGroups: IMuscleGroup[] = [
  {
    id: 1,
    name: "Трапеция",
    muscle: [{ id: 1, name: "Трапецивидная" }],
  },
  {
    id: 2,
    name: "Плечи",
    muscle: [
      { id: 2, name: "Передняя дельта" },
      { id: 3, name: "Средняя дельта" },
      { id: 4, name: "Задняя дельта" },
    ],
  },
  {
    id: 3,
    name: "Шея",
    muscle: [
      { id: 5, name: "Грудино-подъязычная" },
      { id: 6, name: "Грудино-ключично-сосцевидная" },
    ],
  },
  {
    id: 4,
    name: "Бицепс",
    muscle: [
      { id: 8, name: "Плечевая" },
      { id: 9, name: "Длинный пучок" },
      { id: 10, name: "Короткий пучок" },
    ],
  },
  {
    id: 5,
    name: "Трицепс",
    muscle: [
      { id: 11, name: "Боковой пучок" },
      { id: 12, name: "Длинный пучок" },
      { id: 13, name: "Средний пучок" },
    ],
  },
  {
    id: 6,
    name: "Предплечье",
    muscle: [
      { id: 14, name: "Лучевой разгибатель запястья" },
      { id: 15, name: "Длинная мышца, отводящая большой палец кисти" },
      { id: 16, name: "Круглый пронатор" },
      { id: 17, name: "Длинная ладонная" },
      { id: 18, name: "Короткий лучевой разгибатель запястья" },
      { id: 19, name: "Короткий разгибатель большого пальца кисти" },
      { id: 20, name: "Сгибатель кисти" },
      { id: 21, name: "Плечелучевая" },
      { id: 22, name: "Лучевой разгибатель запястья" },
      { id: 23, name: "Локтевой сгибатель запястья" },
    ],
  },
  {
    id: 7,
    name: "Грудь",
    muscle: [
      { id: 24, name: "Большая грудная" },
      { id: 25, name: "Малая грудная" },
    ],
  },
  {
    id: 8,
    name: "Спина",
    muscle: [
      { id: 26, name: "Малая круглая" },
      { id: 27, name: "Большая круглая" },
      { id: 28, name: "Подостная" },
      { id: 29, name: "Ромбовидная" },
      { id: 30, name: "Разгибатель позвоночника" },
      { id: 31, name: "Широчайшие мышцы спины" },
      { id: 32, name: "Внешние косые" },
    ],
  },
  {
    id: 9,
    name: "Пресс",
    muscle: [
      { id: 33, name: "Передняя зубчатая" },
      { id: 34, name: "Наружная косая" },
      { id: 35, name: "Прямая мышца живота" },
    ],
  },
  {
    id: 10,
    name: "Ягодицы",
    muscle: [
      { id: 36, name: "Малая ягодичная мышца" },
      { id: 37, name: "Большая ягодичная мышца" },
    ],
  },
  {
    id: 11,
    name: "Бедра квадрицепс",
    muscle: [
      { id: 38, name: "Портняжная" },
      { id: 39, name: "Гребенчатая" },
      { id: 40, name: "Длинная приводящая" },
      { id: 41, name: "Тонкая" },
      { id: 42, name: "Напрягатель широкой фасции" },
      { id: 43, name: "Широкая медиальная" },
      { id: 44, name: "Широкая латеральная" },
      { id: 45, name: "Прямая мышца бедра" },
    ],
  },
  {
    id: 12,
    name: "Бедра бицепс",
    muscle: [
      { id: 46, name: "Двуглавая мышца бедра" },
      { id: 47, name: "Приводящая" },
      { id: 48, name: "Полусухожильная" },
      { id: 49, name: "Тонкая" },
      { id: 50, name: "Полуперепончатая" },
    ],
  },
  {
    id: 13,
    name: "Голень",
    muscle: [
      { id: 51, name: "Икроножная" },
      { id: 52, name: "Камболовидная" },
      { id: 53, name: "Передняя большеберцовая" },
      { id: 54, name: "Длинный разгибатель пальцев стопы" },
      { id: 55, name: "Длинная малоберцовая" },
    ],
  },
];
